"""
Part 2 - Chapter 03 - Q3 (page 96)
숫자 카드 게임

숫자 카드 게임은 여러 개의 숫자 카드 중에서 가장 높은 숫자가 쓰인 카드 한 장을 뽑는 게임이다.
단, 게임의 룰을 지키며 카드를 뽑아야 하고 룰은 다음과 같다.

1. 숫자가 쓰인 카드들이 N * M 형태로 놓여 있다. 이때 N은 행의 개수를 의미하며, M은 열의 개수를 의미한다.
2. 먼저 뽑고자 하는 카드가 포함되어 있는 행을 선택한다.
3. 그다음 선택된 행에 포함된 카드들 중 가장 숫자가 낮은 카드를 뽑아야 한다.
4. 따라서 처음에 카드를 골라낼 행을 선택할 때, 이후에 해당 행에서 가장 숫자가 낮은 카드를 뽑을 것을 고려하여 최종적으로 가장 높은 숫자의 카드를 뽑을 수 있도록 전략을 세워야 한다.

예를 들어 3 * 3형태로 카드들이 다음과 같이 놓여 있다고 가정하자.
M개
3 1 2
4 1 4  N개
2 2 2
여기서 카드를 골라낼 행을 고를 때 첫 번째 혹은 두 번째 행을 선택하는 경우, 최종적으로 뽑는 카드는 1이다. 하지만 세 번째 행을 선택하는 경우 최종적으로 뽑는 카드는 2이다.
따라서 이 예제에서는 세 번째 행을 선택하여 숫자 2가 쓰여진 카드를 뽑는 것이 정답니다.

카드들이 N * M 형태로 놓여 있을 때, 게임의 룰에 맞게 카드를 뽑는 프로그램을 만드시오.

임력 조건 :
    - 첫째 줄에 숫자 카드들이 놓인 행의 개수 N과 열의 개수 M이 공백을 기준으로 하여 각각 자연수로 주어진다. (1 <= N, M <= 100)
    - 둘째 줄부터 N개의 줄에 걸쳐 각 카드에 적힌 숫자가 주어진다. 각 숫자는 1 이상 10,000 이하의 자연수이다.
출력 조건 :
    - 첫째 줄에 게임의 룰에 맞게 선택한 카드에 적힌 숫자를 출력한다.

입력 예시 1 :
    3 3
    3 1 2
    4 1 4
    2 2 2
출력 예시 1 :
    2

입력 예시 2 :
    2 4
    7 3 1 8
    3 3 3 4
출력 예시 2 :
    3
"""


# -----------------------------------
print("\n -*-*-*-*-*- First -*-*-*-*-*- \n")

N, M = map(int, input().split())
select_card = 0

for loop in range(N):
    card = list(map(int, input().split()))
    N_min = min(card)

    if select_card < N_min:
        select_card = N_min

print("선택 된 카드 : ", select_card)


# -----------------------------------
print("\n -*-*-*-*-*- Second -*-*-*-*-*- \n")
# 짠 코드랑 크게 다른 점은 없음
# 다만 if연산이 아닌 max연산을 사용하여 거르는 방법도 좋아보임

N, M = map(int, input().split())
select_card = 0

for loop in range(N):
    card = list(map(int, input().split()))
    N_min = min(card)
    select_card = max(select_card, N_min)

print("선택 된 카드 : ", select_card)

# -----------------------------------
print("\n -*-*-*-*-*- Third -*-*-*-*-*- \n")
# ... 이거 보단 처음 if문이 더 깔끔하지 않나 싶음...
# 다만 min과 max를 사용하는 방법을 알 것 같아 적음

N, M = map(int, input().split())
select_card = 0

for loop in range(N):
    card = list(map(int, input().split()))
    N_min = 10001 # 10,000이하의 자연수 이므로
    for i in card:
        N_min = min(N_min, i)
    select_card = max(select_card, N_min)

print("선택 된 카드 : ", select_card)
